// 1) shift =>  метод shift() используется для удаления первого элемента из массива и возвращения этого удаленного элемента
        var fruits = ['яблоко', 'груша', 'банан'];

        var removedFruit = fruits.shift();

        console.log('Удаленный фрукт:', removedFruit);
        console.log('Оставшиеся фрукты:', fruits);

// 2) Метод unshift() используется для добавления одного или нескольких элементов в начало массива. 

        var fruits = ['груша', 'банан'];

        fruits.unshift('яблоко'); // добавляем 'яблоко' в начало массива

        console.log('Массив после добавления:', fruits);
// Метод push() в JavaScript используется для добавления одного или нескольких элементов в конец массива.

        var fruits = ['яблоко', 'груша'];

        fruits.push('банан'); // добавляем 'банан' в конец массива

        console.log('Массив после добавления:', fruits);

// =========
const myList = [];
myList.push(
    ["Chocolate Bar", 15],
    ["Milk", 10],
    ['Bread',5],
    ['Salt', 3],
    ["Butter", 20]
)
// =====================

